# Pandas

Panel Data - Kısaltması

## Pandas Series

In [1]:
#Pandas Serileri, verileri indexleri ile birlikte depolar.
import pandas as pd
serie = pd.Series([9,3,5,7])
serie

0    9
1    3
2    5
3    7
dtype: int64

In [6]:
serie.axes

[RangeIndex(start=0, stop=4, step=1)]

In [7]:
serie.dtype

dtype('int64')

In [8]:
serie.ndim

1

In [9]:
serie.size

4

In [12]:
#Indexlerini kendimiz belirleyebiliyoruz.
serie = pd.Series([9,3,5,7], index = ["a","b","c","d"])
serie

a    9
b    3
c    5
d    7
dtype: int64

# DataFrame

Excele benzer yapıda bulunan Pandas veriyapısıdır. Veri setlerinde en çok kullanılan çeşittir.

In [13]:
liste = [11,22,33,44]
df = pd.DataFrame(liste,columns = ["ilk_sutun"])
df

   ilk_sutun
0         11
1         22
2         33
3         44

In [18]:
import numpy as np
list2 = np.arange(1,10).reshape((3,3))
list2

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [20]:
df = pd.DataFrame(list2, columns = ["sutun1","sutun2","sutun3"])
df

   sutun1  sutun2  sutun3
0       1       2       3
1       4       5       6
2       7       8       9

In [21]:
#Sütün isimlerini değiştirmek
df.columns = ["s1","s2","s3"]
df

   s1  s2  s3
0   1   2   3
1   4   5   6
2   7   8   9

In [22]:
#Baştan x değeri almak için
df.head(1)

   s1  s2  s3
0   1   2   3

In [23]:
#Sondan x değeri almak için
df.tail(1)

   s1  s2  s3
2   7   8   9

In [24]:
df.ndim

2

In [25]:
df.shape

(3, 3)

In [26]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['s1', 's2', 's3'], dtype='object')]

In [27]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [28]:
type(df.values)

numpy.ndarray

## DataFrame Eleman İşlemleri

In [2]:
#Sözlükten df oluşturma
import pandas as pd
import numpy as np
var1 = np.random.randint(10, size = 5)
var2 = np.random.randint(10, size = 5)
var3 = np.random.randint(10, size = 5)
sozluk = {"var1" : var1, "var2" : var2, "var3" : var3}
sozluk

{'var1': array([5, 4, 7, 7, 5]),
 'var2': array([1, 4, 9, 2, 7]),
 'var3': array([1, 3, 4, 7, 4])}

In [3]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     1     1
1     4     4     3
2     7     9     4
3     7     2     7
4     5     7     4

In [4]:
#Slice burda da yapılabiliyor
df[0:1]

   var1  var2  var3
0     5     1     1

In [5]:
#indexi kendimiz de tanımlayabiliriz
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     5     1     1
b     4     4     3
c     7     9     4
d     7     2     7
e     5     7     4

In [6]:
df["a":"c"]

   var1  var2  var3
a     5     1     1
b     4     4     3
c     7     9     4

In [51]:
# Geçici silme için .drop fonk kullanılır.
df.drop("a", axis = 0)

   var1  var2  var3
b     8     0     4
c     3     9     4
d     1     1     7
e     2     6     9

In [7]:
#Kalıcı silmek için inplace = True argümanı konulur.
df.drop("a", axis = 0 , inplace = True)
df

   var1  var2  var3
b     4     4     3
c     7     9     4
d     7     2     7
e     5     7     4

In [53]:
#Sutun silmek için key ve axis değişir.
df.drop("var1", axis = 1)

   var2  var3
b     0     4
c     9     4
d     1     7
e     6     9

In [8]:
#Fancy ile birden çok sütün ya da satır droplayabiliriz
df.drop(["b","d"],axis = 0)

   var1  var2  var3
c     7     9     4
e     5     7     4

In [10]:
df["var4"] = df["var2"]/df["var3"]

In [11]:
df

   var1  var2  var3      var4
b     4     4     3  1.333333
c     7     9     4  2.250000
d     7     2     7  0.285714
e     5     7     4  1.750000

In [12]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     4     3
c     7     9     4
d     7     2     7
e     5     7     4

In [14]:
# Fancy yardımıyla birden çok sütunu droplama
l = ["var1","var2"]
df.drop(l,axis=1)

   var3      var4
b     3  1.333333
c     4  2.250000
d     7  0.285714
e     4  1.750000

## Gözlem ve Değişken Seçimi : loc & iloc

In [17]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    10     1     5
1    27    14    24
2    11     1     1
3     8    26    19
4    21    14    15
5     7     7     1
6    26    24     3
7     4    10    19
8    29    14     3
9    28     1     3

In [18]:
# loc : tanımlandığı şekli ile seçim yapmak için kullanılır. yapılan indexlemeye sadık kalır. verilen indexlerin son elemanını da döndürür.

In [19]:
df.loc[0:3]

   var1  var2  var3
0    10     1     5
1    27    14    24
2    11     1     1
3     8    26    19

In [20]:
# iloc : alışık olduğumuz indexleme mantığıyla çalışır.

In [21]:
df.iloc[0:3]

   var1  var2  var3
0    10     1     5
1    27    14    24
2    11     1     1

In [23]:
# Eğer sütün indexi string olarak verilecekse loc kullanılır. iloc'ta hataya sebep olur.
df.loc[0:3, "var3"]

0     5
1    24
2     1
3    19
Name: var3, dtype: int32

In [24]:
df.iloc[0:3, "var3"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [25]:
# Bu hataya alternatif olarak alttaki iki yöntem kullanılabilir.
df.iloc[0:3]["var3"]

0     5
1    24
2     1
Name: var3, dtype: int32

In [27]:
df.iloc[0:3,2]

0     5
1    24
2     1
Name: var3, dtype: int32

## Koşullu Eleman İşlemleri

In [29]:
# Koşullar index elemanları gibi köşeli parantez içine yazılırlar.
df[df.var1 > 15]

   var1  var2  var3
1    27    14    24
4    21    14    15
6    26    24     3
8    29    14     3
9    28     1     3

In [30]:
df[df.var1 > 15]["var1"]

1    27
4    21
6    26
8    29
9    28
Name: var1, dtype: int32

In [31]:
# Belirli sütünları böyle alabileceğimiz gibi loc ile de alabiliriz.
df[df.var1 > 15][["var1","var2"]]

   var1  var2
1    27    14
4    21    14
6    26    24
8    29    14
9    28     1

In [32]:
df.loc[df.var1 > 15, ["var1","var2"]]

   var1  var2
1    27    14
4    21    14
6    26    24
8    29    14
9    28     1

## Join İşlemleri

Birden fazla DF'i birleştirmek istiyorsak bunun için pandas içerisindeki **concat** metodunu kullanırız.

In [1]:
import numpy as np
import pandas as pd

In [11]:
x1 = np.random.randint(1,30,size = (5,3))
x2 = np.random.randint(1,30,size = (5,3))

df1 = pd.DataFrame(x1, columns=["var1","var2","var3"])
df2 = pd.DataFrame(x2, columns=["var1","var2","var3"])

In [ ]:
pd.concat([df1,df2])

Goruldugu uzere indexlerin siralanmasinda bir problem ortaya cikti.
Bunu cozmek icin **ignore_index** attribute degerini True yapmamiz gerekiyor.

In [14]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    18    18    27
1    28    23     8
2    14    26    13
3     3     6    25
4     3    21    11
5     9    10     8
6    21    12    18
7    13     4    21
8    19    24    11
9    22    28    16

In [16]:
df3 = pd.DataFrame(x1, columns=["var1","var2","deger3"])
df4 = pd.DataFrame(x2, columns=["var1","var2","var3"])

pd.concat([df3,df4])

   var1  var2  deger3  var3
0    18    18    27.0   NaN
1    28    23     8.0   NaN
2    14    26    13.0   NaN
3     3     6    25.0   NaN
4     3    21    11.0   NaN
0     9    10     NaN   8.0
1    21    12     NaN  18.0
2    13     4     NaN  21.0
3    19    24     NaN  11.0
4    22    28     NaN  16.0

Column degerleri farkli olan DataFrameleri birlestirmek istedigimizde karsilikli farkli olan columnlarin NaN ile dolduruldugu gorulur.

Eger sadece kesisimleri birlestirmek istersek **join** attribute degerini __inner__ yapmamiz gerekir.

In [17]:
pd.concat([df3,df4],join="inner")

   var1  var2
0    18    18
1    28    23
2    14    26
3     3     6
4     3    21
0     9    10
1    21    12
2    13     4
3    19    24
4    22    28

* one to one
* many to one
* many to many
gibi islemleri **merge** fonksyionu ile gerceklestirilir. Merge fonksiyonuna hangi ortak column secilecegini soylemek istersek **on** attribute icerisine string olarak verilebilir.

## Aggregation & Grouping

- Basic aggregation functions
    * count()
    * first()
    * last()
    * mean()
    * median()
    * min()
    * max()
    * std()
    * var()
    * sum()

In [2]:
import seaborn as sns

In [4]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [5]:
df.shape

(1035, 6)

In [6]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [7]:
df.mean()["number"]

1.7855072463768116

In [8]:
df["number"].mean()

1.7855072463768116

Eger verisetinin hesaplanmis tum degerlerini gormek istedigimizde **describe** ozelligini kullaniyoruz.

In [9]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

describe degerinin transposeunu almak istersek sonuna .T ekleyerek gerceklestirebiliriz.

In [10]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

Eger df icerisindeki bos degeri bu hesaplamaya katmak istemiyorsak **dropna** metodunu kullanabiliriz.

In [13]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Grouping

* Gruplama islemi, Aggeregation ile birlikte kullanilir.
* Veri seti icerisindeki kategorik degiskene gore gruplama yapilir.
* Kategorik degiskene gore gruplama yapildiktan sonra ise kalan degiskenlerden bir tanesi secilerek onun uzerinde aggregation yapilarak gerekli sonuclar elde edilir.

In [15]:
df.groupby("method")

Goruldugu uzere planets veri seti uzerinde kategorik degisken olan method degiskeni uzerinde bir gruplama yaptigimizda herhangi bir sonuc alamayiz.

In [18]:
df.groupby("method")["distance"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

Gruplama yaptiktan sonra hangi degisken uzerinde islem yapacagimizi belirtip aggregation islemimizi gerceklestiriyoruz.

## Aggregate Function

Aggregate metodunda kullanilacak olan aggregation metotlarini biz belirleriz.

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [5]:
df.groupby("method").aggregate(["min",np.median,"max"])

                              number            orbital_period                \
                                 min median max            min        median
method
Astrometry                         1      1   1     246.360000    631.180000
Eclipse Timing Variations          1      2   2    1916.250000   4343.500000
Imaging                            1      1   4    4639.150000  27500.000000
Microlensing                       1      1   2    1825.000000   3300.000000
Orbital Brightness Modulation      1      2   2       0.240104      0.342887
Pulsar Timing                      1      3   3       0.090706     66.541900
Pulsation Timing Variations        1      1   1    1170.000000   1170.000000
Radial Velocity                    1      1   6       0.736540    360.200000
Transit                            1      1   7       0.355000      5.714932
Transit Timing Variations          2      2   3      22.339500     57.011000

                                                mass               distance  \
                                         max     min median    max      min
method
Astrometry                       1016.000000     NaN    NaN    NaN    14.98
Eclipse Timing Variations       10220.000000  4.2000  5.125   6.05   130.72
Imaging                        730000.000000     NaN    NaN    NaN     7.69
Microlensing                     5100.000000     NaN    NaN    NaN  1760.00
Orbital Brightness Modulation       1.544929     NaN    NaN    NaN  1180.00
Pulsar Timing                   36525.000000     NaN    NaN    NaN  1200.00
Pulsation Timing Variations      1170.000000     NaN    NaN    NaN      NaN
Radial Velocity                 17337.500000  0.0036  1.260  25.00     1.35
Transit                           331.600590  1.4700  1.470   1.47    38.00
Transit Timing Variations         160.000000     NaN    NaN    NaN   339.00

                                                  year
                                 median      max   min  median   max
method
Astrometry                       17.875    20.77  2010  2011.5  2013
Eclipse Timing Variations       315.360   500.00  2008  2010.0  2012
Imaging                          40.395   165.00  2004  2009.0  2013
Microlensing                   3840.000  7720.00  2004  2010.0  2013
Orbital Brightness Modulation  1180.000  1180.00  2011  2011.0  2013
Pulsar Timing                  1200.000  1200.00  1992  1994.0  2011
Pulsation Timing Variations         NaN      NaN  2007  2007.0  2007
Radial Velocity                  40.445   354.00  1989  2009.0  2014
Transit                         341.000  8500.00  2002  2012.0  2014
Transit Timing Variations       855.000  2119.00  2011  2012.5  2014

Boylece her bir degisken icin ayri ayri aggreagtion metotlarini uygulayabiliriz.

Burada aggregate metodu icerisine liste seklinde aggregation yontemlerini veriyoruz. Pandas icerisindeki metotlari verirken hem string hem de normal olarak verebiliriz. String olarak vermek farkindalik acisindan kolaylik saglar.

In [8]:
df.groupby("method").aggregate({"number" : "min", "distance" : "max"})

                               number  distance
method
Astrometry                          1     20.77
Eclipse Timing Variations           1    500.00
Imaging                             1    165.00
Microlensing                        1   7720.00
Orbital Brightness Modulation       1   1180.00
Pulsar Timing                       1   1200.00
Pulsation Timing Variations         1       NaN
Radial Velocity                     1    354.00
Transit                             1   8500.00
Transit Timing Variations           2   2119.00

Bu sekildeki kullanimda ise her bir attribute icin farkli bir aggr. yontemi belirleyebiliriz.

## Filter Function

Filter fonksiyonu kendi tanimladigimiz bir fonksiyon ile belirli sorgulari yapmayi ve ona gore veri setinden filtreleme yapip sonuclari almayi saglayan bir metottur.

In [29]:
df = pd.DataFrame({"groups" : ['A', 'B', 'C' , 'A', 'B', 'C'],
                   "degisken1" : [1 , 22 ,3 , 44 , 5 , 66],
                   "degisken2" : [111,22,333,44,555,66]})
df

  groups  degisken1  degisken2
0      A          1        111
1      B         22         22
2      C          3        333
3      A         44         44
4      B          5        555
5      C         66         66

In [30]:
def filter_func(x):
    return x["degisken1"].std() > 25

In [32]:
df.groupby("groups").filter(filter_func)

  groups  degisken1  degisken2
0      A          1        111
2      C          3        333
3      A         44         44
5      C         66         66

## Transform Function

* Transfrom fonksiyonu vertorel calisan bir fonksiyondur.
* Kendi tanimladigimiz fonksiyonu, degiskenlerin degerlerine uygular. Yani sutun bazli calisir.
* Sayisal bir ifade gerceklestirilecekse, kategorik degiskenlerden kurtulmak gerekir.

In [34]:
# Hata alindi
df.transform(lambda x : x-x.mean())

TypeError: Could not convert ABCABC to numeric

In [36]:
df.iloc[:,1:3].transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -22.5      -77.5
1       -1.5     -166.5
2      -20.5      144.5
3       20.5     -144.5
4      -18.5      366.5
5       42.5     -122.5

## Apply Function

* Transfrom ve Filter fonksiyonu gibi DataFrame'in degiskenleri uzerinde gezinme yetenigi olan ve Aggregation amaciyla kullanilabileek olan bir fonksiyondur.

In [37]:
df.apply(np.sum)

groups       ABCABC
degisken1       141
degisken2      1131
dtype: object

# Pivot Tables

* Pivot tablolar, veri seti uzerinde bazi satir ve sutunsal islemler gerceklestirerek veri setini amaca uygun hale getirmek icin kullanilan yapilardir.
* Groupby ile karistirilmaktadir. Groupby'in cok boyutlu bir versiyonu olarak dusunulmelidir.

In [2]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# ilkel pivot islemi

titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [6]:
# Pivot islemi
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [7]:
# Unstack farki

titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [9]:
# Pivot table kullanimi
# ilk parametre odaklandigimiz degisken, index x ekseninde var olacak degerleri iceren degisken, columns ise de y ekseninde var olacak degerleri iceren degiskendir.
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Surekli bir veri setini kategorik bir veri setine cevirerek pivot table islemi gerceklestirelim.

In [10]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [13]:
age = pd.cut(titanic.age,[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [14]:
titanic.pivot_table("survived",index=["sex",age],columns="class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663